print("//----- Стойност по подразбиране на параметъра end='\\n' -----//")
print(1)
print(2)
print(3)
print(1, 2, 3, end='!')
print('\n\n')

print('//----- Повтаряне на шаблони(Placeholders) -----//')
print('{1} + {1} * {1} = {0}'.format(3 + 3 * 3, 3))
print('\n\n')

print('//----- Степенуване 2 ** 10 -----//')
print(2 ** 10)
print('\n\n')


print('//----- В Python не можем директно да конкатенираме число към даден текст -----//')
a = 5.5
b = 3.4
result = 'The sum is: ' + str(int(a + b))
print(result)
print('\n\n')

# print('//-----  -----//')
# print('//-----  -----//')
# print('//-----  -----//')
# print('//-----  -----//')
# print('//-----  -----//')
# print('//-----  -----//')
# print('//-----  -----//')
# print('//-----  -----//')
# print('//-----  -----//')